In [1]:
import numpy as np

In [213]:
import pandas as pd

In [246]:
players.head()

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing,popularity
0,Alexis Sanchez,Arsenal,28,GK,1,65.0,4329,12.0,17.10%,264,3,Chile,0,4,1,1,0,Super popular
1,Mesut Ozil,Arsenal,28,GK,1,50.0,4395,9.5,5.60%,167,2,Germany,0,4,1,1,0,Super popular
2,Petr Cech,Arsenal,35,GK,4,7.0,2001,5.5,5.90%,134,2,Czech Republic,0,6,1,1,0,popular
3,Theo Walcott,Arsenal,28,GK,1,20.0,2393,7.5,1.50%,122,1,England,0,4,1,1,0,Super popular
4,Laurent Koscielny,Arsenal,31,CB,3,22.0,912,6.0,0.70%,121,2,France,0,4,1,1,0,popular

In [250]:
players.popularity.unique()

array(['Super popular', 'popular', 'kind of popular',
       'relatively unknown'], dtype=object)

In [248]:
'name' in players

True

In [251]:
players['MVtoFPL'] = 1

In [253]:
players.MVtoFPL

0      1
1      1
2      1
3      1
4      1
      ..
460    1
461    1
462    1
463    1
464    1
Name: MVtoFPL, Length: 465, dtype: int64

In [254]:
players.MVtoFPL = players.market_value/players.fpl_value

In [255]:
players.MVtoFPL

0      5.416667
1      5.263158
2      1.272727
3      2.666667
4      3.666667
         ...
460    1.111111
461    1.555556
462    1.000000
463    0.222222
464    1.818182
Name: MVtoFPL, Length: 465, dtype: float64

In [274]:
df_mini = players.iloc[:4,1:5]

In [275]:
df_mini

      club  age position  position_cat
0  Arsenal   28       GK             1
1  Arsenal   28       GK             1
2  Arsenal   35       GK             4
3  Arsenal   28       GK             1

In [276]:
s_names = ['A','B','C','D']

In [277]:
df_mini['names'] = 1

In [279]:
df_mini

      club  age position  position_cat  names
0  Arsenal   28       GK             1      1
1  Arsenal   28       GK             1      1
2  Arsenal   35       GK             4      1
3  Arsenal   28       GK             1      1

In [269]:
df_mini.drop(labels=['A','B','C'],axis=1,inplace=True)

In [280]:
df_mini['names'] = s_names

In [287]:
df_mini

      club  age position  position_cat
0  Arsenal   28       GK             1
1  Arsenal   28       GK             1
2  Arsenal   35       GK             4
3  Arsenal   28       GK             1

In [ ]:
df_mini.append(dict)

In [289]:
crisitano = pd.Series(
    {
    'club':'Man',
     'age':22,
    'position':'CF',
    'position_cat':2
    }
)

In [293]:
df_mini.append(crisitano,ignore_index=True)

C:\Users\97798\AppData\Local\Temp\ipykernel_14484\2503194216.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_mini.append(crisitano,ignore_index=True)

      club  age position  position_cat
0  Arsenal   28       GK             1
1  Arsenal   28       GK             1
2  Arsenal   35       GK             4
3  Arsenal   28       GK             1
4      Man   22       CF             2